#----------------------------------------------------------------------  #ЗАМІНЯЄМИЙ СПИСОК

salary_list = [6.4, 9.35, 11.4, 14, 23.8, 28.15, 34.7] 

#----------------------------------------------------------------------  #ФУНКЦІЯ, ЩО ЗАПИСУЄ ЗАРПЛАТУ ДО, РАХУЄ ПІСЛЯ ТА ВИРАХОВУЄ РІЗНИЦЮ

def funct(list1):
    salary = list(map(lambda i : round(i * 1.30, 2), list1))
    list2 = list(map(lambda k: k, list1))
    dif = list(map(lambda i, k: round((i-k), 2), salary, list2))
    for n in range(len(list1)):
        print (list1[n], salary[n], dif[n])

#----------------------------------------------------------------------  #ФУНКЦІЯ ВИЩОГО ПОРЯДКУ

def apply(x, fun):
    return fun(x)

#----------------------------------------------------------------------  #ЗАПУСК ТА ВИВІД РЕЗУЛЬТАТУ 

print("Salary list:")
apply(salary_list, funct)