#-------------------------------------------------------------------------------------------------------
#ГЕНЕРАЦІЯ СПИСКУ УСІХ МАЛЕНЬКИХ БУКВ АНГЛІЙСЬКОГО АЛФАВІТУ В 

import string
eng_letters = list(string.ascii_lowercase)

#-------------------------------------------------------------------------------------------------------
#ЗМІННІ, ЩО ЗНАДОБЛЯТЬСЯ ЗГОДОМ

dict = []
letter_count = 0

#-------------------------------------------------------------------------------------------------------
#ПІДРАХОВУЄ КІЛЬКІСТЬ БУКВ У ТЕКСТІ

with open("gadsby.txt", "r") as file:
    for line in file:
        for letter in line:
            if letter.isalpha():
                letter_count += 1

#-------------------------------------------------------------------------------------------------------
#ПІДРАХОВУЄ КІЛЬКІСТЬ КОНКРЕТНИХ ЛІТЕР АЛФАВІТУ ТА ДОДАЄ У СПИСОК У ВИГЛЯДІ ['ВІДСОТОК БУКВИ У ТЕКСТІ', 'БУКВА']

for eng_letter in eng_letters:
    y = 0

    with open("gadsby.txt", "r") as file:

        for line in file:

            for letter in line:

                if letter.isalpha():
                    letter = letter.lower()

                    if letter  == eng_letter:
                        y += 1

    elem = [round(y/letter_count*100, 3), eng_letter]   
    dict.append(elem) 
dict.sort(reverse=True)
dict = dict[:5] + dict[-5:]

#-------------------------------------------------------------------------------------------------------
#ВИВІД РЕЗУЛЬТАТУ

for enum in dict:
    print(f"Буква: {enum[1]}, займає {enum[0]}% усіх букв.")